---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotOpenFileForRead
source: html/cf25b065-902d-0a53-4333-df4f410b0779.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotOpenFileForRead Property

Cannot open file [FileName].

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotOpenFileForRead { get; }
```